-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Vært: 127.0.0.1
-- Genereringstid: 09. 06 2019 kl. 11:38:32
-- Serverversion: 10.1.29-MariaDB
-- PHP-version: 7.0.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fooddatabase`
--

-- --------------------------------------------------------

--
-- Struktur-dump for tabellen `grøntsager`
--

CREATE TABLE `grøntsager` (
  `Id` int(11) NOT NULL,
  `Fødevare` varchar(255) NOT NULL,
  `Kcal` varchar(255) NOT NULL,
  `KJ` varchar(255) NOT NULL,
  `Protein` varchar(255) NOT NULL,
  `Fedt` varchar(255) NOT NULL,
  `Kulhydrat` varchar(255) NOT NULL,
  `Kostfibre` varchar(255) NOT NULL,
  `Calcium` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Data dump for tabellen `grøntsager`
--

INSERT INTO `grøntsager` (`Id`, `Fødevare`, `Kcal`, `KJ`, `Protein`, `Fedt`, `Kulhydrat`, `Kostfibre`, `Calcium`) VALUES
(1, 'Agurk med skræl', '15', '63', '0,7', '0,1', '2,1', '0,5', '16'),
(2, 'Agurk uden skræl', '12', '50', '0,6', '0,2', '2,2', '0,7', '14'),
(3, 'Agurk, sylt m, dild, rå', '12', '50', '0,5', '0,3', '2,4', '1', '57'),
(4, 'Artiskok', '47', '196', '3,3', '0,2', '10,5', '5,4', '44'),
(5, 'Artiskokhjerter, konserves, i lage', '27', '113', '1,5', '0,1', '5,4', '1,5', '31'),
(6, 'Artiskokhjerter, konserves, i olie', '82', '342', '2,4', '5,9', '5,9', '3,5', '24'),
(7, 'Artiskokhjerter, marinerede', '89', '372', '1,8', '5,4', '7,1', '1,8', '71'),
(8, 'Asparges, frost, kogt', '18', '75', '2,9', '0,4', '1,9', '1,6', '18'),
(9, 'Asparges, grønne', '20', '84', '2,2', '0,1', '3,9', '2,1', '24'),
(10, 'Asparges, hvide', '25', '104', '2', '0,2', '4,9', '2', '17'),
(11, 'Asparges, hvide, konserves, i lage', '15', '63', '1,8', '0,2', '2,5', '1', '15'),
(12, 'Asparges, kogt', '22', '92', '2,4', '0,2', '4,1', '2', '23'),
(13, 'Aubergine', '23', '96', '1,1', '0,2', '4,9', '3', '9'),
(14, 'Bambusskud, konserves', '19', '79', '1,7', '0,4', '3,2', '1,4', '8'),
(15, 'Bambusskud, Makino, kogt', '20', '84', '2,1', '0,2', '3,3', '1,8', '26'),
(16, 'Bambusskud, Moso, rå', '40', '167', '3,9', '0,2', '6', '1', '55'),
(17, 'Basilikum', '23', '96', '3,2', '0,6', '2,7', '1,6', '177'),
(18, 'Basilikum, tørret, krydderi, urt', '233', '973', '23', '4,1', '47,8', '37,7', '2240'),
(19, 'Batat, sød kartoffel', '86', '359', '1,6', '0,1', '25', '3', '30'),
(20, 'Batat, sød kartoffel, bagt, med skræl', '90', '376', '2', '0,2', '20,7', '3,3', '38'),
(21, 'Batat, sød kartoffel, chips, snacks', '532', '2221', '2,9', '32,4', '56,8', '8,8', '59'),
(22, 'Bata, sød kartoffel, kogt, med skræl', '76', '317', '1,4', '0,1', '17,7', '2,5', '27'),
(23, 'Bitter melon', '19', '79', '0,9', '0,1', '0,7', '2,8', '20'),
(24, 'Bladbede, sølvbede', '19', '79', '1,8', '0,2', '3,7', '1,6', '51'),
(25, 'Bladbede, sølvbede, kogt i letsaltet vand', '20', '84', '1,9', '0,1', '4,1', '10,5', '58'),
(26, 'Bladselleri', '16', '67', '0,7', '0,2', '3', '1,6', '40'),
(27, 'Blomkål', '25', '104', '1,9', '0,3', '5', '2', '22'),
(28, 'Broccoli', '34', '142', '2,8', '0,4', '6,5', '2,6', '47'),
(29, 'Broccoli, frost, kogt', '28', '117', '3,1', '0,1', '5,4', '3', '33'),
(30, 'Broccoli, kogt', '35', '146', '2,4', '0,4', '7,2', '3,3', '40'),
(31, 'Brøndkarse', '11', '46', '2,3', '0,1', '1,5', '0,5', '120'),
(32, 'Cayote, Keyote', '19', '79', '0,8', '0,1', '4,5', '1,7', '17'),
(33, 'Chili, peber, stærk, rød', '40', '167', '2', '0,4', '8,8', '1,5', '14'),
(34, 'Dild', '43', '180', '3,5', '1,1', '7', '2,1', '208'),
(35, 'Dild, frø, tørret', '305', '1273', '16', '14,5', '55,2', '21,1', '1516'),
(36, 'Fennikel, knold', '31', '129', '1,2', '0,2', '7,3', '3,1', '49'),
(37, 'Fennikelfrø, tørret, krydderi', '345', '1440', '15,8', '14,9', '52,3', '39,8', '1196'),
(38, 'Forårsløg', '32', '134', '1,8', '0,2', '7,3', '2,6', '72'),
(39, 'Græskar', '26', '109', '1', '0,1', '6,5', '1', '21'),
(40, 'Græskarblomster, ca, 50 stk', '15', '63', '1', '0,1', '3,3', '1', '39'),
(41, 'Grønkål', '49', '205', '4,3', '0,9', '8,8', '3,6', '150'),
(42, 'Grønkål, frost, kogt', '30', '125', '2,8', '0,5', '5,3', '2', '138'),
(43, 'Gulerod', '36', '150', '0,7', '0,1', '9,6', '2,6', '33'),
(44, 'Hvidkål', '25', '104', '1,3', '0,1', '5,8', '2,5', '40'),
(45, 'Hvidløg', '149', '662', '6,4', '0,5', '33,1', '2,1', '18'),
(46, 'Hvidløg, pulver, krydderi', '331', '1382', '16,6', '0,7', '72,7', '9', '79'),
(47, 'Ingefær, rod, frisk, Kina', '46', '192', '1,3', '0,6', '10,3', '3,3', '27'),
(48, 'Ingefær, rod, pulver, krydderi', '332', '1386', '10,4', '3,6', '18', '19,8', '195'),
(49, 'Jordskok', '73', '305', '2,1', '0,01', '17,4', '1,6', '27'),
(50, 'Jordskok, kogt', '69', '288', '2', '0,01', '12,9', '4,5', '26'),
(51, 'Julesalat', '17', '71', '0,9', '0,1', '4', '3,1', '19'),
(52, 'Karse', '32', '134', '2,6', '0,7', '5,5', '1,1', '81'),
(53, 'Kartoffel, uspecifik', '77', '321', '2,1', '0,1', '17,5', '2,1', '12'),
(54, 'Kartoffel, chips (franske kartofler)', '532', '2221', '6,4', '34', '53,8', '3,1', '21'),
(55, 'Kartoffel, pommes frites (friturestegte)', '323', '1349', '3,4', '15,5', '42,6', '3,9', '13'),
(56, 'Kartoffelmel', '357', '1490', '6,9', '0,3', '83,1', '5,9', '65'),
(57, 'Kinakål', '16', '67', '1,2', '0,2', '3,2', '1,2', '42'),
(58, 'Kinaradise', '18', '75', '0,6', '0,1', '4,1', '1,6', '27'),
(59, 'Knoldselleri', '42', '175', '1,5', '0,3', '9,2', '1,8', '42'),
(60, 'Knudekål, glaskål', '23', '96', '1,7', '0,2', '3,6', '1,8', '24'),
(61, 'Koriander, blade og stilk', '26', '108', '2,3', '0,29', '4,5', '3,2', '61'),
(62, 'Kørvel, blade og stilk', '27', '113', '2,8', '1,9', '2,7', '1,7', '400'),
(63, 'Kålrabi, kålroe', '27', '113', '1,7', '1,1', '6,2', '3,6', '24'),
(64, 'Lotus', '74', '309', '2,6', '0,1', '17,2', '4,9', '45'),
(65, 'Lotus, kogt', '66', '276', '1,6', '0,07', '16', '3,1', '26'),
(66, 'Lucernespirer, Alfalfa frøspire', '23', '96', '4', '0,7', '2,1', '1,9', '32'),
(67, 'Løg', '40', '167', '1,1', '0,3', '10', '1,9', '23'),
(68, 'Løg, ristede løg', '571', '2384', '0', '35,7', '42,9', '2', '0'),
(69, 'Løgringe, indbagte, frosne, opvarmede i ovn', '276', '1152', '4,1', '14,3', '33,8', '2,2', '31'),
(70, 'Majroe', '28', '117', '0,9', '0,1', '6,4', '2', '30'),
(71, 'Maniok, Kassava, Topioka', '160', '668', '1,4', '0,3', '38,1', '1,8', '16'),
(72, 'Mælkebøtte, blade', '45', '188', '2,7', '0,7', '9,2', '3,5', '187'),
(73, 'Okra', '33', '138', '2', '0,1', '7,5', '3,2', '81'),
(74, 'Paksoi, pak-choi', '13', '54', '1,5', '0,2', '2,2', '1', '105'),
(75, 'Pastinak', '71', '296', '1,5', '0,3', '13,9', '3,8', '33'),
(76, 'Peberfrugt, grøn', '29', '121', '0,9', '0,2', '5,9', '1,8', '10'),
(77, 'Peberfrugt, rød', '31', '129', '1,3', '0,3', '6,2', '2,1', '7'),
(78, 'Peberrod', '96', '401', '7,7', '0,7', '11', '7,5', '120'),
(79, 'Persille', '36', '150', '3', '0,8', '7,1', '4,1', '153'),
(80, 'Persillerod', '54', '225', '2,3', '0,6', '10', '4', '46'),
(81, 'Porre', '36', '150', '1,8', '0,3', '7,7', '2,2', '42'),
(82, 'Purløg', '30', '125', '3,3', '0,7', '4,4', '2,5', '92'),
(83, 'Rabarber', '21', '88', '0,9', '0,3', '6,8', '3,8', '115'),
(84, 'Radise', '16', '67', '0,7', '0,1', '3,4', '1,6', '25'),
(85, 'Rosenkål, frost', '43', '180', '3,8', '0,4', '7,9', '3,8', '26'),
(86, 'Rosenkål, uspecifik', '52', '217', '4,3', '0,6', '5,4', '4,5', '23'),
(87, 'Rødbede', '43', '180', '1,6', '0,2', '9,6', '2,8', '25'),
(88, 'Rødbede, konserves, uden sukker', '30', '125', '0,7', '0,1', '7,1', '2', '17'),
(89, 'Rødkål', '31', '129', '1,4', '0,2', '7,4', '2,1', '45'),
(90, 'Rødkål, kogt', '29', '121', '1,5', '0,1', '6,9', '2,6', '42'),
(91, 'Salat, egeløv', '16', '67', '1,4', '0,2', '2,9', '1,6', '50'),
(92, 'Salat, endivie, escarole, frisé', '17', '71', '1,3', '0,2', '3,4', '3,1', '52'),
(93, 'Salat, feldsalat, vårsalat, kornsalat', '21', '88', '2', '0,4', '3,6', '1,8', '38'),
(94, 'Salat, hovedsalat', '13', '54', '1,3', '0,4', '4', '1,3', '52'),
(95, 'Salat, iceberg', '14', '58', '0,9', '0,1', '3,2', '1,1', '18'),
(96, 'Salat, radicchio', '23', '96', '1,4', '0,3', '4,5', '0,9', '19'),
(97, 'Salat, romaine', '17', '71', '1,2', '0,3', '3,3', '2,1', '47'),
(98, 'Salat, ærteskud', '31', '129', '3,7', '0,5', '4,4', '2,3', '36'),
(99, 'Savoykål', '27', '113', '2', '0,1', '6,1', '3,1', '35'),
(100, 'Spidskål', '24', '100', '1,4', '0,2', '4,9', '1,9', '35'),
(101, 'Spinat', '23', '96', '2,9', '0,4', '3,6', '2,2', '127'),
(102, 'Squash, butternut', '45', '188', '1', '0,1', '11,7', '2', '48'),
(103, 'Squash, spaghetti', '31', '129', '0,6', '0,6', '6,9', '1,5', '23'),
(104, 'Squash, zucchini', '16', '67', '1,2', '0,2', '3,4', '1,1', '20'),
(105, 'Svamp, Champignon, brun', '22', '92', '2,5', '0,1', '4,3', '0,6', '18'),
(106, 'Svamp, Champignon, hvid', '24', '100', '2,9', '0,3', '3,6', '1,5', '6'),
(107, 'Svamp, Enoki, brun', '39', '163', '2,7', '0,3', '7,7', '2,5', '2'),
(108, 'Svamp, Enoki, hvid', '37', '154', '2,6', '0,3', '7,2', '2,3', '1'),
(109, 'Svamp, Judasøre', '39', '163', '1,1', '0,2', '9', '7,7', '27'),
(110, 'Svamp, Kantarel', '38', '159', '2', '0,5', '6,9', '3,8', '15'),
(111, 'Svamp, Kejserhat', '39', '163', '2,8', '0,2', '7,9', '4,2', '1'),
(112, 'Svamp, Maitake', '31', '129', '1,9', '0,2', '7', '2,7', '1'),
(113, 'Svamp, Morel', '31', '129', '3,1', '0,6', '5,1', '2,8', '43'),
(114, 'Svamp, Portobello', '22', '92', '2,1', '0,4', '3,9', '1,3', '3'),
(115, 'Svamp, Shiitake', '34', '142', '2,2', '0,49', '6,8', '2,5', '2'),
(116, 'Svamp, Shiitake, tørrede', '335', '1399', '22,6', '1,5', '67,6', '37,5', '106'),
(117, 'Svamp, Straw, Paddy, konserves', '31', '129', '3,3', '0,1', '5,4', '3,2', '6'),
(118, 'Svamp, Østershat', '33', '138', '3,3', '0,41', '6,1', '2,3', '3'),
(119, 'Tang, agar, tørret', '306', '1278', '6,2', '0,3', '80', '7,7', '625'),
(120, 'Tang, ager, rå', '26', '109', '0,5', '0,03', '6,8', '0,5', '54'),
(121, 'Tang, arame, tørret, Japansk', '327', '1635', '9,6', '1,9', '68', '44', '600'),
(122, 'Tang, kombu', '20', '94', '0,8', '0,1', '4,4', '2,8', '91'),
(123, 'Tang, kombu, tørret, uspecificeret', '267', '1115', '9,1', '2,7', '51', '0,4', '790'),
(124, 'Tang, nori sushi tang, tørret, uspecificeret', '278', '1161', '46,5', '3,7', '32,1', '26,5', '298'),
(125, 'Tang, spirulina, tørret', '290', '1211', '57,5', '7,72', '23,9', '3,6', '120'),
(126, 'Tang, Wakeme, rå', '45', '188', '3', '0,6', '9', '0,5', '150'),
(127, 'Tang, wakame, tørret, Japansk', '216', '902', '18', '3,2', '29', '25', '825'),
(128, 'Tomat, uspecificeret', '18', '75', '0,8', '0,2', '3,9', '1,2', '10'),
(129, 'Vandkastanje, Kina, dåse', '50', '209', '0,9', '0,06', '12,3', '2,1', '3'),
(130, 'Vandkastanje, Kina, frisk, rå', '67', '280', '1,7', '0,1', '14,5', '2,1', '3'),
(131, 'Wasabi, japansk peberrod', '109', '455', '4,8', '0,6', '23,5', '7,8', '128'),
(132, 'Wok blanding, frossen grøntsagsblanding', '34', '142', '1,7', '0,5', '4,9', '6,2', '40'),
(133, 'Yams', '118', '493', '1,5', '0,2', '27,9', '4,1', '17');

--
-- Begrænsninger for dumpede tabeller
--

--
-- Indeks for tabel `grøntsager`
--
ALTER TABLE `grøntsager`
  ADD PRIMARY KEY (`Id`);

--
-- Brug ikke AUTO_INCREMENT for slettede tabeller
--

--
-- Tilføj AUTO_INCREMENT i tabel `grøntsager`
--
ALTER TABLE `grøntsager`
  MODIFY `Id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=134;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
